scripthub/lib/tasks/import.rake

INSERT INTO "users" ("first_name", "last_name", "username", "email", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  task users: :environment do
    # intializes an empty array for your table
    users = []
    # the below variable makes a file relative to the root of your app
    users_file = File.join Rails.root, "users.csv"
    CSV.foreach(users_file, headers: true) do |row|
      users << User.new(row.to_h)